1/p/TEST/src/DataProcessors/ТС_Тестирование/ТС_Тестирование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ТС_Тестирование</name>
  <comment>Начать тестирование</comment>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.ТС_Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>CatalogRef.ТС_Курсы</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборТестов</name>
    <type>
      <types>CatalogRef.ТС_НаборыТестов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаОбучения</name>
    <type>
      <types>CatalogRef.ТС_ПрограммыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЭтапа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Избранное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзбранноеАвто</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоТестов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьТестыИзИзбранного</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Тесты</name>
    <attributes>
      <name>Тест</name>
      <type>
        <types>CatalogRef.ТС_Тесты</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вопрос</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Изображение</name>
      <type>
        <types>CatalogRef.ТС_Файлы</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзображениеСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерОтвета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Правильный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьПодтверждение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьПодсказка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьВИзбранном</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Выбор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Проверен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

1/p/TEST/src/InformationRegisters/ТС_ИзбранныеТесты/ТС_ИзбранныеТесты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТС_ИзбранныеТесты</name>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.ТС_Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Курс</name>
    <type>
      <types>CatalogRef.ТС_Курсы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тест</name>
    <type>
      <types>CatalogRef.ТС_Тесты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Авто</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

1/p/TEST/src/InformationRegisters/ТС_РезультатыТестирований/ТС_РезультатыТестирований.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТС_РезультатыТестирований</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Правильный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НомерЭтапа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.ТС_Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Курс</name>
    <type>
      <types>CatalogRef.ТС_Курсы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тест</name>
    <type>
      <types>CatalogRef.ТС_Тесты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НаборТестов</name>
    <type>
      <types>CatalogRef.ТС_НаборыТестов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрограммаОбучения</name>
    <type>
      <types>CatalogRef.ТС_ПрограммыОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерТестирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтоПодтверждениеОтвета</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

1/p/TEST/src/DataProcessors/ТС_Тестирование/ObjectModule.bsl
//*************************************************************
Функция СформироватьРезультатТестирования() Экспорт
	
	//Првоерим количество тестов
	Если Тесты.Количество() = 0 Тогда
		Возврат "Нет тестов для создания документа!";
	КонецЕсли;
	
	//Переменная запрос
	Запрос = Новый Запрос;
	
	//Удалим тесты из избранных, если это необходимо
	Если Избранное И (УдалятьТестыИзИзбранного ИЛИ ИзбранноеАвто) Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТС_ИзбранныеТесты.Пользователь,
		|	ТС_ИзбранныеТесты.Курс,
		|	ТС_ИзбранныеТесты.Тест
		|ИЗ
		|	РегистрСведений.ТС_ИзбранныеТесты КАК ТС_ИзбранныеТесты
		|ГДЕ
		|	НЕ ТС_ИзбранныеТесты.Тест В (&ТестыИзТестирования)
		|	И ТС_ИзбранныеТесты.Пользователь = &Пользователь
		|	И ТС_ИзбранныеТесты.Курс = &Курс
		|	И ИСТИНА";
		
		Если ИзбранноеАвто Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"ИСТИНА","НЕ ТС_ИзбранныеТесты.Авто");
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Пользователь",Пользователь);
		Запрос.УстановитьПараметр("Курс",Курс);
		Запрос.УстановитьПараметр("ТестыИзТестирования",Тесты.ВыгрузитьКолонку("Тест"));
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();	
			
		НаборЗаписей = РегистрыСведений.ТС_ИзбранныеТесты.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Курс.Значение = Курс;
		НаборЗаписей.Отбор.Курс.Использование = Истина;
		НаборЗаписей.Отбор.Пользователь.Значение = Пользователь;
		НаборЗаписей.Отбор.Пользователь.Использование = Истина;
		НаборЗаписей.Загрузить(РезультатЗапроса);
		
		Попытка
			НаборЗаписей.Записать(Истина);
		Исключение
			Возврат ОписаниеОшибки();
		КонецПопытки;
	
	КонецЕсли;
		
	//Получим номер тестирования
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ISNULL(МАКСИМУМ(ТС_РезультатыТестирований.НомерТестирования),0) КАК НомерТестирования
	|ИЗ
	|	РегистрСведений.ТС_РезультатыТестирований КАК ТС_РезультатыТестирований
	|ГДЕ
	|	ТС_РезультатыТестирований.Пользователь = &Пользователь
	|	И ТС_РезультатыТестирований.Курс = &Курс
	|	И ТС_РезультатыТестирований.НаборТестов = &НаборТестов";	
	Запрос.УстановитьПараметр("Курс", Курс);
	Запрос.УстановитьПараметр("НаборТестов", НаборТестов);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Если  ВыборкаДетальныеЗаписи.Следующий() Тогда
		НомерТестирования = ВыборкаДетальныеЗаписи.НомерТестирования + 1;
	Иначе
		НомерТестирования = 1;
	КонецЕсли;
	
	//Создадим новый документ тестирования
	РезультатТестирования = Документы.ТС_РезультатТестирования.СоздатьДокумент();
	РезультатТестирования.Дата = ТекущаяДата();
	РезультатТестирования.Курс = Курс;
	РезультатТестирования.НаборТестов = НаборТестов;
	РезультатТестирования.Пользователь = Пользователь;
	РезультатТестирования.НомерТестирования = НомерТестирования;
	РезультатТестирования.ПрограммаОбучения = ПрограммаОбучения;
	РезультатТестирования.НомерЭтапа = НомерЭтапа;
	
	СтрокаОтвет = "";
	флОтветВерен = Истина;
	ПредыдущийТест = Тесты.Получить(0).Тест;
	СписокВерныхТестов = Новый СписокЗначений;	
	
	Для Каждого Строка ИЗ Тесты Цикл
		
		ТекТест = Строка.Тест;
		Если ТекТест <> ПредыдущийТест Тогда
			
			//Добавим строку в документ
			НоваяСтрокаДокумента = РезультатТестирования.Тесты.Добавить();
			НоваяСтрокаДокумента.Тест = ПредыдущийТест;
			НоваяСтрокаДокумента.Ответ = СтрокаОтвет;
			НоваяСтрокаДокумента.Правильный = флОтветВерен;
			
			//Добавим правильный ответ с список
			Если Избранное И (УдалятьТестыИзИзбранного ИЛИ ИзбранноеАвто) И флОтветВерен Тогда
				СписокВерныхТестов.Добавить(ПредыдущийТест);
			КонецЕсли;
			НомерТеста = Тесты.Индекс(Строка);
			
			СтрокаОтвет = "";
			флОтветВерен = Истина;
			ПредыдущийТест = ТекТест;
			
		КонецЕсли;
		
		Если Строка.Правильный 
			И флОтветВерен 
			И НЕ Строка.Выбор Тогда
				флОтветВерен = Ложь;
		КонецЕсли;
		
		Если Строка.Выбор Тогда
			СтрокаОтвет = ?(СтрДлина(СтрокаОтвет)=0,"",СтрокаОтвет + ", ") + Строка(Строка.НомерОтвета);
		КонецЕсли;	
		
	КонецЦикла;
	
	//Добавим последнюю строку в документ
	НоваяСтрокаДокумента = РезультатТестирования.Тесты.Добавить();
	НоваяСтрокаДокумента.Тест = ПредыдущийТест;
	НоваяСтрокаДокумента.Ответ = СтрокаОтвет;
	НоваяСтрокаДокумента.Правильный = флОтветВерен;
	
	//Добавим правильный ответ с список и отметим тесты в общем списке
	Если Избранное И (УдалятьТестыИзИзбранного ИЛИ ИзбранноеАвто) И флОтветВерен Тогда
		
		СписокВерныхТестов.Добавить(ПредыдущийТест);
		
		Для Каждого Строка ИЗ Тесты Цикл			
			Если СписокВерныхТестов.НайтиПоЗначению(Строка.Тест) <> Неопределено Тогда
				Строка.ЕстьВИзбранном = Ложь;
			КонецЕсли;			
		КонецЦикла	
		
	КонецЕсли;
	
	Попытка
		РезультатТестирования.Записать(РежимЗаписиДокумента.Проведение);
		Возврат Истина;
	Исключение
		Возврат ОписаниеОшибки();		
	КонецПопытки;	
	
КонецФункции
